Revit 2027 API
PointOnEdge.LocationOnCurve Property
The point location on curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointLocationOnCurve LocationOnCurve { get; }
Public ReadOnly Property LocationOnCurve As PointLocationOnCurve
	Get
public:
property PointLocationOnCurve^ LocationOnCurve {
	PointLocationOnCurve^ get ();
}
member LocationOnCurve : PointLocationOnCurve with get
Property Value
PointLocationOnCurve
See Also
Reference
PointOnEdge Class
Autodesk.Revit.DB Namespace